Tekla Open API Reference for Tekla Structures 2025
Part.GetComponents Method
 Returns an enumerator of all the connected components, connections, seams and details inherited from the base component.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ModelObjectEnumerator GetComponents()
Public Function GetComponents As ModelObjectEnumerator
Return Value
Type: ModelObjectEnumerator
A model object enumerator on success, otherwise null.
See Also
Reference
Part Class
Tekla.Structures.Model Namespace